<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF">
<p><font face="Arial, Helvetica, sans-serif" size="4">Weitere Details</font></p>
<blockquote>
  <blockquote>
    <p><font face="Arial, Helvetica, sans-serif" size="2">Diese Beispielszene steht nur f&uuml;r einen winzigen Teil der Leistungsf&auml;higkeit des Havok Xtra. W&auml;hrend bisher alles auf der Grundlage von Lingo-Skripts erstellt wurde, k&ouml;nnen HKE-Dateien auch aus einem Programm zum Erstellen von 3D-Modellen exportiert und als Darsteller importiert werden. Dies geschieht in &auml;hnlicher Weise bei Shockwave 3D-Dateien (*.W3D), die aus vielen Programmen zum Erstellen von 3D-Modellen exportiert werden k&ouml;nnen. </font></p>
    <p><font face="Arial, Helvetica, sans-serif" size="2">So k&ouml;nnen Sie im Handumdrehen Inhalte f&uuml;r physikalisch korrekte 3D-Szenen erstellen. Details zu Plug-Ins f&uuml;r Programme zum Erstellen von 3D-Modellen finden Sie auf der Website von <a href="http://www.havok.com" target="_self">Havok</a>.</font></p>
    <p><font face="Arial, Helvetica, sans-serif" size="2">Doch werden nicht nur exportierte Dateien unterst&uuml;tzt, es werden auch zahlreiche Verhalten mitgeliefert. Auf diese kann in Macromedia Director auf dieselbe Weise zugegriffen werden und sie k&ouml;nnen auf dieselbe Weise verwendet werden wie alle anderen verf&uuml;gbaren Verhalten. Zwei Gruppen sind dabei zu unterscheiden: "Setup" und "Control".</font></p>
    <p><font face="Arial, Helvetica, sans-serif" size="2">Die Verhalten vom Typ "Setup" umfassen die grundlegenden Funktionen, die in dieser Kurzanleitung beschrieben wurden. Initialisierung, Stepping und Beendigung werden von den Verhalten <b>Physics (HKE)</b> und <b>Physics (No HKE)</b> ausgef&uuml;hrt, w&auml;hrend andere Verhalten f&uuml;r das Verwenden von Starrk&ouml;rpern oder das Erstellen von Federn und Sto&szlig;d&auml;mpfern verantwortlich sind. </font></p>
    <p><font face="Arial, Helvetica, sans-serif" size="2">Die Verhalten vom Typ "Control" stellen Beispiele f&uuml;r komplexere Wechselbeziehungen in einer nach den Gesetzen der Physik simulierten Szene bereit. Das Verhalten <b>Move Model</b> erm&ouml;glicht es beispielsweise, Starrk&ouml;rper mit Hilfe der Maus zu beeinflussen, w&auml;hrend mit <b>Drive Model</b> jeder Starrk&ouml;rper wie ein Auto gesteuert werden kann. </font></p>
    <p><font face="Arial, Helvetica, sans-serif" size="2">All diese Verhalten k&ouml;nnen Sie nach Belieben verwenden, untersuchen und ver&auml;ndern.</font></p>
  </blockquote>
</blockquote>
<p>&nbsp;</p>
</body>
</html>
