<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body bgcolor="#FFFFFF">
<p><font face="Arial, Helvetica, sans-serif" size="4">Einf&uuml;hrung</font></p>
<blockquote>
  <blockquote>
    <p><font face="Arial, Helvetica, sans-serif" size="2">Das Havok Xtra ist eine vollst&auml;ndig integrierte Physiksimulations-Engine f&uuml;r Starrk&ouml;rper, die f&uuml;r Macromedia Director konzipiert ist. Mit dem Havok Xtra haben Sie uneingeschr&auml;nkten Zugriff auf physikalische Eigenschaften und Ereignisse, wodurch Sie absolute Kontrolle &uuml;ber deren simulierte Welt aus&uuml;ben. Sie k&ouml;nnen physikalischen K&ouml;rpern beispielsweise Eigenschaften wie Masse oder Elastizit&auml;t zuweisen, Kr&auml;fte, Impulse oder Drehmomente anwenden sowie Geschwindigkeiten und Momente festlegen. Au&szlig;erdem k&ouml;nnen Sie angeben, ob bestimmte Zusammenst&ouml;&szlig;e von Starrk&ouml;rpern erfolgen k&ouml;nnen oder ob diese vollst&auml;ndig deaktiviert werden sollen. Es ist m&ouml;glich, HKE-Dateien (Havok-Exportdateien) zu importieren, wodurch Sie ganze Physikszenen in einem Programm zum Erstellen von 3D-Modellen (z. B. 3ds max) erzeugen k&ouml;nnen, ohne dass Lingo-Skripts erforderlich sind. </font></p>
    <p><font face="Arial, Helvetica, sans-serif" size="2"> Der Lieferumfang des Havok Xtra umfasst eine Verhaltensbibliothek, um das Erstellen von Physikszenen zu vereinfachen, und mehrere Demos, die Ihnen einen Einblick in die zahlreichen leistungsstarken Funktionen der Engine geben.</font></p>
    <p><font face="Arial, Helvetica, sans-serif" size="2"> Ein Havok-Darsteller enth&auml;lt alle erforderlichen Informationen, um eine statische 3D-Welt in eine dynamische, nach den Gesetzen der Physik simulierte Welt zu verwandeln. Jeder Havok-Darsteller ist mit einem Director-3D-Darsteller verbunden. Es ist nicht erforderlich, Sprites unmittelbar aus einem Havok-Darsteller zu erstellen, da die dynamische Welt durch ein 3D-Sprite angezeigt wird.</font></p>
    <p><font face="Arial, Helvetica, sans-serif" size="2">Eine von Havok gesteuerte 3D-Welt wird in mehreren Stufen erstellt und aktualisiert:</font></p>
    <ul>
      <li><font face="Arial, Helvetica, sans-serif" size="2"> Initialisieren einschlie&szlig;lich Erstellen von Starrk&ouml;rpern </font></li>
      <li><font face="Arial, Helvetica, sans-serif" size="2"> Anwenden externer Eingaben auf die Simulation (z. B. Kr&auml;fte, Drehmomente usw.).</font></li>
      <li><font face="Arial, Helvetica, sans-serif" size="2">Stepping: Simulation ausf&uuml;hren und f&uuml;r ein Fortschreiten der Zeit in der entsprechenden Welt sorgen. </font></li>
      <li><font face="Arial, Helvetica, sans-serif" size="2">Beenden. </font></li>
    </ul>
    <p><font face="Arial, Helvetica, sans-serif" size="2">In dieser Kurzanleitung werden die wichtigsten Funktionen des Havok Xtra beschrieben. Grundlegende Kenntnisse des Programms Macromedia Director und seiner Lingo-Skriptsprache werden vorausgesetzt. Sie erstellen nun unter Anleitung eine einfache Szene mit physikalischen Eigenschaften und lernen nebenbei die wichtigsten Komponenten kennen. Weitere Informationen zum Arbeiten mit dem Havok Xtra finden Sie im "Havok Xtra-Lingo-Referenzhandbuch", im "Havok Xtra-Verhaltensreferenzhandbuch" und zahlreichen anderen Dokumenten und Beispielen auf der <a href="http://www.havok.com/xtra"> Havok Xtra-Entwickler-Website</a>. </font></p>
  </blockquote>
</blockquote>
</body>
</html>
